Revit 2027 API
PanelScheduleData.SummaryShowsGroups Property
 Show groups of load classifications in the load summary section
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SummaryShowsGroups { get; set; }
Public Property SummaryShowsGroups As Boolean
	Get
	Set
public:
property bool SummaryShowsGroups {
	bool get ();
	void set (bool value);
}
member SummaryShowsGroups : bool with get, set
Property Value
Boolean
See Also
Reference
PanelScheduleData Class
Autodesk.Revit.DB.Electrical Namespace